import 'package:get/get.dart';
import 'package:khalsha/core/models/item_model.dart';

class CommonQuestionsController extends GetxController {
  List<ItemModel> commonQuestions = const <ItemModel>[
    ItemModel(
      text: 'ما هي الخدمات التي تقدمها خلصها ؟',
      description:
          'تعتبر خلصها أول منصة رقمية تقدم جميع الخدمات اللوجستية في مكان واحد و بطريقة ذكية و سهله حيث انها تساهم في تمكين المستورد أو المصدر بالبحث عن جميع مزودين الخدمات اللوجستية بسرعة و سهولة, كما أن منصة خلصها تمتاز في تقليل التكاليف المترتبة على الشركات أو الافراد من حيث سهولة البحث عن الخدمة المطلوبة مع مقارنة الأسعار ومعرفة المتطلبات الازمة.',
    ),
    ItemModel(
      text: 'ما الذي سأستفيده كمستورد أو مصدر ؟',
      description:
          'في حال كنت مستورد أو مصدر سواء كان مجال نشاطك مصنع , شركة, مؤسسة أو فرد فأنت لا تحتاج الى فريق متكامل لإدارة شحناتك فهنا في منصة خلصها و بغضون دقائق معدودة وبأقل جهد , تستطيع أرسال الطلب الخاص بشحنتك وبطريقة محترفة وسهلة الى جميع مقدمين الخدمات اللوجستية المتواجدين على منصة خلصها ومن ثم الحصول على عروض الأسعار المصممة خصيصاً لملائمة متطلباتك واحتياجاتك.',
    ),
    ItemModel(
      text: 'ما هي الخدمات التي تقدمها خلصها ؟',
      description:
          'تعتبر خلصها أول منصة رقمية تقدم جميع الخدمات اللوجستية في مكان واحد و بطريقة ذكية و سهله حيث انها تساهم في تمكين المستورد أو المصدر بالبحث عن جميع مزودين الخدمات اللوجستية بسرعة و سهولة, كما أن منصة خلصها تمتاز في تقليل التكاليف المترتبة على الشركات أو الافراد من حيث سهولة البحث عن الخدمة المطلوبة مع مقارنة الأسعار ومعرفة المتطلبات الازمة.',
    ),
    ItemModel(
      text: 'ما الذي سأستفيده كمستورد أو مصدر ؟',
      description:
          'في حال كنت مستورد أو مصدر سواء كان مجال نشاطك مصنع , شركة, مؤسسة أو فرد فأنت لا تحتاج الى فريق متكامل لإدارة شحناتك فهنا في منصة خلصها و بغضون دقائق معدودة وبأقل جهد , تستطيع أرسال الطلب الخاص بشحنتك وبطريقة محترفة وسهلة الى جميع مقدمين الخدمات اللوجستية المتواجدين على منصة خلصها ومن ثم الحصول على عروض الأسعار المصممة خصيصاً لملائمة متطلباتك واحتياجاتك.',
    ),
    ItemModel(
      text: 'ما هي الخدمات التي تقدمها خلصها ؟',
      description:
          'تعتبر خلصها أول منصة رقمية تقدم جميع الخدمات اللوجستية في مكان واحد و بطريقة ذكية و سهله حيث انها تساهم في تمكين المستورد أو المصدر بالبحث عن جميع مزودين الخدمات اللوجستية بسرعة و سهولة, كما أن منصة خلصها تمتاز في تقليل التكاليف المترتبة على الشركات أو الافراد من حيث سهولة البحث عن الخدمة المطلوبة مع مقارنة الأسعار ومعرفة المتطلبات الازمة.',
    ),
    ItemModel(
      text: 'ما الذي سأستفيده كمستورد أو مصدر ؟',
      description:
          'في حال كنت مستورد أو مصدر سواء كان مجال نشاطك مصنع , شركة, مؤسسة أو فرد فأنت لا تحتاج الى فريق متكامل لإدارة شحناتك فهنا في منصة خلصها و بغضون دقائق معدودة وبأقل جهد , تستطيع أرسال الطلب الخاص بشحنتك وبطريقة محترفة وسهلة الى جميع مقدمين الخدمات اللوجستية المتواجدين على منصة خلصها ومن ثم الحصول على عروض الأسعار المصممة خصيصاً لملائمة متطلباتك واحتياجاتك.',
    ),
  ];
}
